Revit 2027 API
CurtainGridSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual CurtainGridSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As CurtainGridSetIterator
public:
virtual CurtainGridSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> CurtainGridSetIterator
override ForwardIterator : unit -> CurtainGridSetIterator
Return Value
CurtainGridSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
CurtainGridSet Class
Autodesk.Revit.DB Namespace